### AWS UAT App plan Part # 1
  #### Terraform Format and Style 🖌`success`
  #### Terraform Initialization ⚙️`success`
  #### Terraform Plan 📖`success`
  <details><summary>Show Plan</summary>
  ```

  [command]/home/runner/work/_temp/c511c7a6-7520-4f29-9080-fcfdab7b1115/terraform-bin show -no-color plan.tfplan

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/404-df322531.js"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/404-df322531.js"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.marshmallowmeat.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "marshmallowmeat.com"
            "Project"         = "tf-web"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/README-7ff6e7c2.js"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/README-7ff6e7c2.js"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.marshmallowmeat.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "marshmallowmeat.com"
            "Project"         = "tf-web"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/_...all_-580ec62b.js"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/_...all_-580ec62b.js"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.marshmallowmeat.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "marshmallowmeat.com"
            "Project"         = "tf-web"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/_name_-da4e430c.js"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/_name_-da4e430c.js"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.marshmallowmeat.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "marshmallowmeat.com"
            "Project"         = "tf-web"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/about-faeacb54.js"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/about-faeacb54.js"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.marshmallowmeat.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "marshmallowmeat.com"
            "Project"         = "tf-web"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/app-92f594ea.js"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/app-92f594ea.js"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.marshmallowmeat.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "marshmallowmeat.com"
            "Project"         = "tf-web"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/home-c2095013.js"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/home-c2095013.js"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.marshmallowmeat.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "marshmallowmeat.com"
            "Project"         = "tf-web"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/virtual_pwa-register-86bd6921.js"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/virtual_pwa-register-86bd6921.js"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.marshmallowmeat.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "marshmallowmeat.com"
            "Project"         = "tf-web"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.s3_object_uat.aws_s3_bucket_object.this[".html"] will be destroyed
  # (because key [".html"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.marshmallowmeat.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "text/html" -> null
      - etag                   = "d06d3d84a6e3ce2f724e062bd2d37752" -> null
      - force_destroy          = true -> null
      - id                     = ".html" -> null
      - key                    = ".html" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/.html" -> null
      - source_hash            = "d06d3d84a6e3ce2f724e062bd2d37752" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["about.html"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "about.html"
      ~ source_hash            = "4da871def1ae05cad082e41d4b863ad9" -> "9e9a3c456e4b46838d627d9d9ce4c9a8"
        tags                   = {
            "Bucket"          = "uat.marshmallowmeat.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "marshmallowmeat.com"
            "Project"         = "tf-web"
            "Terraform"       = "true"
        }
      + version_id             = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/404-c52255aa.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.marshmallowmeat.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/404-c52255aa.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/404-c52255aa.js"
      + source_hash            = "f4041072e6d81bbeeb966d0304daf73c"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/404-df322531.js"] will be destroyed
  # (because key ["assets/404-df322531.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.marshmallowmeat.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "1e738464142d78ad5e1b4bbe663c8815" -> null
      - force_destroy          = true -> null
      - id                     = "assets/404-df322531.js" -> null
      - key                    = "assets/404-df322531.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/404-df322531.js" -> null
      - source_hash            = "1e738464142d78ad5e1b4bbe663c8815" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/README-7efbc08e.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.marshmallowmeat.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/README-7efbc08e.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/README-7efbc08e.js"
      + source_hash            = "f6a08dff13c47f5499e9c332b8041088"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/README-7ff6e7c2.js"] will be destroyed
  # (because key ["assets/README-7ff6e7c2.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.marshmallowmeat.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "e370473ac334484dac61ecf707cfa838" -> null
      - force_destroy          = true -> null
      - id                     = "assets/README-7ff6e7c2.js" -> null
      - key                    = "assets/README-7ff6e7c2.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/README-7ff6e7c2.js" -> null
      - source_hash            = "e370473ac334484dac61ecf707cfa838" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/_...all_-221b48da.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.marshmallowmeat.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/_...all_-221b48da.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/_...all_-221b48da.js"
      + source_hash            = "8984846d82e019e782b413e2b5fba280"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/_...all_-580ec62b.js"] will be destroyed
  # (because key ["assets/_...all_-580ec62b.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.marshmallowmeat.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "4349b7d29205810a3f0a3c95398f5334" -> null
      - force_destroy          = true -> null
      - id                     = "assets/_...all_-580ec62b.js" -> null
      - key                    = "assets/_...all_-580ec62b.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/_...all_-580ec62b.js" -> null
      - source_hash            = "4349b7d29205810a3f0a3c95398f5334" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/_name_-2fc5d9a9.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.marshmallowmeat.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/_name_-2fc5d9a9.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/_name_-2fc5d9a9.js"
      + source_hash            = "0ea4f111d41f28b2cfc9d50d4672fa91"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/_name_-da4e430c.js"] will be destroyed
  # (because key ["assets/_name_-da4e430c.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.marshmallowmeat.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "6c6018217a77d3ea39acf19a8f3fcef5" -> null
      - force_destroy          = true -> null
      - id                     = "assets/_name_-da4e430c.js" -> null
      - key                    = "assets/_name_-da4e430c.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/_name_-da4e430c.js" -> null
      - source_hash            = "6c6018217a77d3ea39acf19a8f3fcef5" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/about-626fd287.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.marshmallowmeat.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/about-626fd287.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/about-626fd287.js"
      + source_hash            = "c9d35fde6ede38ec0c8fe35fb84e282e"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/about-faeacb54.js"] will be destroyed
  # (because key ["assets/about-faeacb54.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.marshmallowmeat.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "9f3fbd81e048de329f79e220d49a70c5" -> null
      - force_destroy          = true -> null
      - id                     = "assets/about-faeacb54.js" -> null
      - key                    = "assets/about-faeacb54.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/about-faeacb54.js" -> null
      - source_hash            = "9f3fbd81e048de329f79e220d49a70c5" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/app-7932c3c1.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.marshmallowmeat.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/app-7932c3c1.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/app-7932c3c1.js"
      + source_hash            = "3d4e633233a0391d35966e8dd8004be1"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/app-92f594ea.js"] will be destroyed
  # (because key ["assets/app-92f594ea.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.marshmallowmeat.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "a6069bec58ef6fb53f10c6a3fa900832" -> null
      - force_destroy          = true -> null
      - id                     = "assets/app-92f594ea.js" -> null
      - key                    = "assets/app-92f594ea.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/app-92f594ea.js" -> null
      - source_hash            = "a6069bec58ef6fb53f10c6a3fa900832" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/home-c2095013.js"] will be destroyed
  # (because key ["assets/home-c2095013.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.marshmallowmeat.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "d7d2ca344909213f3a772160846c2fda" -> null
      - force_destroy          = true -> null
      - id                     = "assets/home-c2095013.js" -> null
      - key                    = "assets/home-c2095013.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/home-c2095013.js" -> null
      - source_hash            = "d7d2ca344909213f3a772160846c2fda" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/home-eb07c450.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.marshmallowmeat.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/home-eb07c450.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/home-eb07c450.js"
      + source_hash            = "180148695119bbaad6ef8a11e11a386f"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/virtual_pwa-register-4142e188.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.marshmallowmeat.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/virtual_pwa-register-4142e188.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/virtual_pwa-register-4142e188.js"
      + source_hash            = "c676b96d79611b95c2742527cbe11ee0"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/virtual_pwa-register-86bd6921.js"] will be destroyed
  # (because key ["assets/virtual_pwa-register-86bd6921.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.marshmallowmeat.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "d0613a31a15f67a2d4f93bb24b3aed9e" -> null
      - force_destroy          = true -> null
      - id                     = "assets/virtual_pwa-register-86bd6921.js" -> null
      - key                    = "assets/virtual_pwa-register-86bd6921.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/virtual_pwa-register-86bd6921.js" -> null
      - source_hash            = "d0613a31a15f67a2d4f93bb24b3aed9e" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["index.html"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "index.html"
      ~ source_hash            = "e1014715e4c32810f44343b86055eeb5" -> "c0c3e3addc548a1b4591d2f4b0edcd1c"
        tags                   = {
            "Bucket"          = "uat.marshmallowmeat.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "marshmallowmeat.com"
            "Project"         = "tf-web"
            "Terraform"       = "true"
        }
      + version_id             = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["readme.html"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "readme.html"
      ~ source_hash            = "6ae6e7074ec6926ee42e490858f0dd91" -> "7f3c480c23da75329a567078c6205bb2"
        tags                   = {
            "Bucket"          = "uat.marshmallowmeat.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "marshmallowmeat.com"
            "Project"         = "tf-web"
            "Terraform"       = "true"
        }
      + version_id             = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["sitemap.xml"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "sitemap.xml"
      ~ source_hash            = "f626a9f9771b640e0312878bfc880e97" -> "e4a0ed0fe7a519f61ca2ff4e591a4d19"
        tags                   = {
            "Bucket"          = "uat.marshmallowmeat.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "marshmallowmeat.com"
            "Project"         = "tf-web"
            "Terraform"       = "true"
        }
      + version_id             = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["ssr-manifest.json"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "ssr-manifest.json"
      ~ source_hash            = "e5857248b7cc35af30482ead63f1b4c7" -> "d0eb087605dfe9ae637e307597d76664"
        tags                   = {
            "Bucket"          = "uat.marshmallowmeat.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "marshmallowmeat.com"
            "Project"         = "tf-web"
            "Terraform"       = "true"
        }
      + version_id             = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["sw.js"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "sw.js"
      ~ source_hash            = "64825a8bb998bdf98ec4576e34cb4672" -> "97302c2f035414d75334fe70e80084e6"
        tags                   = {
            "Bucket"          = "uat.marshmallowmeat.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "marshmallowmeat.com"
            "Project"         = "tf-web"
            "Terraform"       = "true"
        }
      + version_id             = (known after apply)
        # (13 unchanged attributes hidden)
    }

Plan: 8 to add, 6 to change, 9 to destroy.

Changes to Outputs:
  ~ s3_bucket_object_etags       = [
      - "d06d3d84a6e3ce2f724e062bd2d37752",
        "8274f68f0ec4b7bd6eab988987eaf299",
        "4da871def1ae05cad082e41d4b863ad9",
      - "1e738464142d78ad5e1b4bbe663c8815",
      - "e370473ac334484dac61ecf707cfa838",
      - "4349b7d29205810a3f0a3c95398f5334",
      - "6c6018217a77d3ea39acf19a8f3fcef5",
      - "9f3fbd81e048de329f79e220d49a70c5",
      - "a6069bec58ef6fb53f10c6a3fa900832",
      - "d7d2ca344909213f3a772160846c2fda",
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
        "a202d7ec6bb4ef58e833474ba09f6de7",
      - "d0613a31a15f67a2d4f93bb24b3aed9e",
      + (known after apply),
        "b8c9397a5a7bdb9aee024d2c57d41845",
        # (13 unchanged elements hidden)
    ]
  ~ s3_bucket_object_ids         = [
      - ".html",
        "_headers",
        "about.html",
      - "assets/404-df322531.js",
      - "assets/README-7ff6e7c2.js",
      - "assets/_...all_-580ec62b.js",
      - "assets/_name_-da4e430c.js",
      - "assets/about-faeacb54.js",
      - "assets/app-92f594ea.js",
      - "assets/home-c2095013.js",
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
        "assets/index-f44d04de.css",
      - "assets/virtual_pwa-register-86bd6921.js",
      + (known after apply),
        "assets/workbox-window.prod.es5-295a6886.js",
        # (13 unchanged elements hidden)
    ]
  ~ s3_bucket_object_keys_ids    = [
      - {
          - id  = ".html"
          - key = ".html"
        },
        {
            id  = "_headers"
            key = "_headers"
        },
        {
            id  = "about.html"
            key = "about.html"
        },
      ~ {
          ~ id  = "assets/404-df322531.js" -> (known after apply)
          ~ key = "assets/404-df322531.js" -> "assets/404-c52255aa.js"
        },
      ~ {
          ~ id  = "assets/README-7ff6e7c2.js" -> (known after apply)
          ~ key = "assets/README-7ff6e7c2.js" -> "assets/README-7efbc08e.js"
        },
      ~ {
          ~ id  = "assets/_...all_-580ec62b.js" -> (known after apply)
          ~ key = "assets/_...all_-580ec62b.js" -> "assets/_...all_-221b48da.js"
        },
      ~ {
          ~ id  = "assets/_name_-da4e430c.js" -> (known after apply)
          ~ key = "assets/_name_-da4e430c.js" -> "assets/_name_-2fc5d9a9.js"
        },
      ~ {
          ~ id  = "assets/about-faeacb54.js" -> (known after apply)
          ~ key = "assets/about-faeacb54.js" -> "assets/about-626fd287.js"
        },
      ~ {
          ~ id  = "assets/app-92f594ea.js" -> (known after apply)
          ~ key = "assets/app-92f594ea.js" -> "assets/app-7932c3c1.js"
        },
      ~ {
          ~ id  = "assets/home-c2095013.js" -> (known after apply)
          ~ key = "assets/home-c2095013.js" -> "assets/home-eb07c450.js"
        },
        {
            id  = "assets/index-f44d04de.css"
            key = "assets/index-f44d04de.css"
        },
      ~ {
          ~ id  = "assets/virtual_pwa-register-86bd6921.js" -> (known after apply)
          ~ key = "assets/virtual_pwa-register-86bd6921.js" -> "assets/virtual_pwa-register-4142e188.js"
        },
        {
            id  = "assets/workbox-window.prod.es5-295a6886.js"
            key = "assets/workbox-window.prod.es5-295a6886.js"
        },
        # (13 unchanged elements hidden)
    ]
  ~ s3_bucket_object_version_ids = [
        "",
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
        "",
      + (known after apply),
        "",
        # (1 unchanged element hidden)
        "",
      + (known after apply),
        "",
        # (1 unchanged element hidden)
        "",
      + (known after apply),
        "",
        "",
      + (known after apply),
      + (known after apply),
      + (known after apply),
        "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
    ]
::debug::Terraform exited with code 0.
::debug::stdout: %0ANote: Objects have changed outside of Terraform%0A%0ATerraform detected the following changes made outside of Terraform since the%0Alast "terraform apply" which may have affected this plan:%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/404-df322531.js"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/404-df322531.js"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.marshmallowmeat.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "marshmallowmeat.com"%0A            "Project"         = "tf-web"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/README-7ff6e7c2.js"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/README-7ff6e7c2.js"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.marshmallowmeat.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "marshmallowmeat.com"%0A            "Project"         = "tf-web"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/_...all_-580ec62b.js"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/_...all_-580ec62b.js"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.marshmallowmeat.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "marshmallowmeat.com"%0A            "Project"         = "tf-web"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/_name_-da4e430c.js"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/_name_-da4e430c.js"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.marshmallowmeat.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "marshmallowmeat.com"%0A            "Project"         = "tf-web"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/about-faeacb54.js"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/about-faeacb54.js"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.marshmallowmeat.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "marshmallowmeat.com"%0A            "Project"         = "tf-web"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/app-92f594ea.js"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/app-92f594ea.js"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.marshmallowmeat.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "marshmallowmeat.com"%0A            "Project"         = "tf-web"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/home-c2095013.js"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/home-c2095013.js"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.marshmallowmeat.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "marshmallowmeat.com"%0A            "Project"         = "tf-web"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/virtual_pwa-register-86bd6921.js"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/virtual_pwa-register-86bd6921.js"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.marshmallowmeat.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "marshmallowmeat.com"%0A            "Project"         = "tf-web"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A%0AUnless you have made equivalent changes to your configuration, or ignored the%0Arelevant attributes using ignore_changes, the following plan may include%0Aactions to undo or respond to these changes.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A  - destroy%0A%0ATerraform will perform the following actions:%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this[".html"] will be destroyed%0A  # (because key [".html"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "private" -> null%0A      - bucket                 = "uat.marshmallowmeat.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "text/html" -> null%0A      - etag                   = "d06d3d84a6e3ce2f724e062bd2d37752" -> null%0A      - force_destroy          = true -> null%0A      - id                     = ".html" -> null%0A      - key                    = ".html" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - source                 = "./../../../../../app/build/.html" -> null%0A      - source_hash            = "d06d3d84a6e3ce2f724e062bd2d37752" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A      - tags_all               = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["about.html"] will be updated in-place%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "about.html"%0A      ~ source_hash            = "4da871def1ae05cad082e41d4b863ad9" -> "9e9a3c456e4b46838d627d9d9ce4c9a8"%0A        tags                   = {%0A            "Bucket"          = "uat.marshmallowmeat.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "marshmallowmeat.com"%0A            "Project"         = "tf-web"%0A            "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/404-c52255aa.js"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "private"%0A      + bucket                 = "uat.marshmallowmeat.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "application/javascript"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "assets/404-c52255aa.js"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/assets/404-c52255aa.js"%0A      + source_hash            = "f4041072e6d81bbeeb966d0304daf73c"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.marshmallowmeat.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "marshmallowmeat.com"%0A          + "Project"         = "tf-web"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.marshmallowmeat.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "marshmallowmeat.com"%0A          + "Project"         = "tf-web"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/404-df322531.js"] will be destroyed%0A  # (because key ["assets/404-df322531.js"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "private" -> null%0A      - bucket                 = "uat.marshmallowmeat.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "application/javascript" -> null%0A      - etag                   = "1e738464142d78ad5e1b4bbe663c8815" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/404-df322531.js" -> null%0A      - key                    = "assets/404-df322531.js" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - source                 = "./../../../../../app/build/assets/404-df322531.js" -> null%0A      - source_hash            = "1e738464142d78ad5e1b4bbe663c8815" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A      - tags_all               = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/README-7efbc08e.js"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "private"%0A      + bucket                 = "uat.marshmallowmeat.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "application/javascript"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "assets/README-7efbc08e.js"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/assets/README-7efbc08e.js"%0A      + source_hash            = "f6a08dff13c47f5499e9c332b8041088"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.marshmallowmeat.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "marshmallowmeat.com"%0A          + "Project"         = "tf-web"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.marshmallowmeat.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "marshmallowmeat.com"%0A          + "Project"         = "tf-web"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/README-7ff6e7c2.js"] will be destroyed%0A  # (because key ["assets/README-7ff6e7c2.js"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "private" -> null%0A      - bucket                 = "uat.marshmallowmeat.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "application/javascript" -> null%0A      - etag                   = "e370473ac334484dac61ecf707cfa838" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/README-7ff6e7c2.js" -> null%0A      - key                    = "assets/README-7ff6e7c2.js" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - source                 = "./../../../../../app/build/assets/README-7ff6e7c2.js" -> null%0A      - source_hash            = "e370473ac334484dac61ecf707cfa838" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A      - tags_all               = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/_...all_-221b48da.js"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "private"%0A      + bucket                 = "uat.marshmallowmeat.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "application/javascript"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "assets/_...all_-221b48da.js"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/assets/_...all_-221b48da.js"%0A      + source_hash            = "8984846d82e019e782b413e2b5fba280"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.marshmallowmeat.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "marshmallowmeat.com"%0A          + "Project"         = "tf-web"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.marshmallowmeat.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "marshmallowmeat.com"%0A          + "Project"         = "tf-web"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/_...all_-580ec62b.js"] will be destroyed%0A  # (because key ["assets/_...all_-580ec62b.js"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "private" -> null%0A      - bucket                 = "uat.marshmallowmeat.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "application/javascript" -> null%0A      - etag                   = "4349b7d29205810a3f0a3c95398f5334" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/_...all_-580ec62b.js" -> null%0A      - key                    = "assets/_...all_-580ec62b.js" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - source                 = "./../../../../../app/build/assets/_...all_-580ec62b.js" -> null%0A      - source_hash            = "4349b7d29205810a3f0a3c95398f5334" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A      - tags_all               = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/_name_-2fc5d9a9.js"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "private"%0A      + bucket                 = "uat.marshmallowmeat.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "application/javascript"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "assets/_name_-2fc5d9a9.js"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/assets/_name_-2fc5d9a9.js"%0A      + source_hash            = "0ea4f111d41f28b2cfc9d50d4672fa91"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.marshmallowmeat.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "marshmallowmeat.com"%0A          + "Project"         = "tf-web"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.marshmallowmeat.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "marshmallowmeat.com"%0A          + "Project"         = "tf-web"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/_name_-da4e430c.js"] will be destroyed%0A  # (because key ["assets/_name_-da4e430c.js"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "private" -> null%0A      - bucket                 = "uat.marshmallowmeat.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "application/javascript" -> null%0A      - etag                   = "6c6018217a77d3ea39acf19a8f3fcef5" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/_name_-da4e430c.js" -> null%0A      - key                    = "assets/_name_-da4e430c.js" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - source                 = "./../../../../../app/build/assets/_name_-da4e430c.js" -> null%0A      - source_hash            = "6c6018217a77d3ea39acf19a8f3fcef5" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A      - tags_all               = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/about-626fd287.js"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "private"%0A      + bucket                 = "uat.marshmallowmeat.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "application/javascript"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "assets/about-626fd287.js"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/assets/about-626fd287.js"%0A      + source_hash            = "c9d35fde6ede38ec0c8fe35fb84e282e"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.marshmallowmeat.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "marshmallowmeat.com"%0A          + "Project"         = "tf-web"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.marshmallowmeat.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "marshmallowmeat.com"%0A          + "Project"         = "tf-web"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/about-faeacb54.js"] will be destroyed%0A  # (because key ["assets/about-faeacb54.js"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "private" -> null%0A      - bucket                 = "uat.marshmallowmeat.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "application/javascript" -> null%0A      - etag                   = "9f3fbd81e048de329f79e220d49a70c5" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/about-faeacb54.js" -> null%0A      - key                    = "assets/about-faeacb54.js" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - source                 = "./../../../../../app/build/assets/about-faeacb54.js" -> null%0A      - source_hash            = "9f3fbd81e048de329f79e220d49a70c5" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A      - tags_all               = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "t
  ```
  </details>
  *Pusher: @shortpoet, Action: `pull_request`, Working Directory: ``, Workflow: `App Infra`*